------- Setting ulimits -------
core file size (blocks)     unlimited
data seg size (kbytes)      unlimited
file size (blocks)          4194303
open files                  1024
pipe size (512 bytes)       10
stack size (kbytes)         unlimited
cpu time (seconds)          172800
max user processes          1957
virtual memory (kbytes)     unlimited
 %% INFO-Suez: 
// -----------------------------------------------------------
//  Welcome to Suez, the CLEO III data access program         
// -----------------------------------------------------------

 %% INFO-Suez: $Id: SuezMain.cc,v 1.67 2002/01/03 21:07:26 cdj Exp $

 %% SYSTEM-Interpreter.TclInterpreter: 
//  For a list of available commands, type "help".              
//                                                                
//  Since the command interpreter is based on a Tcl interpreter,  
//  all Tcl commands are available.                               
//  For info on tcl: "http://www.scriptics.com/resource/doc"    

 %% SYSTEM-Interpreter.TclInterpreter: 
// Renaming the following Tcl commands:
//  (because they collide with Suez commands!)
// -------------------------------------------
//  source --> tcl_source
//  proc   --> tcl_proc
//  file   --> tcl_file

 %% SYSTEM-Module: added command "summary" from SummaryModule
 %% SYSTEM-Module: added command "source_format" from SourceFormatMap
 %% SYSTEM-Module: added command "sink_format" from SinkFormatMap
 %% SYSTEM-Module: added command "source" from SourceManager
 %% SYSTEM-Module: added command "stream" from SourceManager
 %% SYSTEM-Module: added command "sink" from SinkManager
 %% SYSTEM-Module: added command "default" from DefaultModule
 %% SYSTEM-Module: added command "prod" from MasterProducer
 %% SYSTEM-Module: added command "proc" from MasterProcessor
 %% SYSTEM-Module: added command "file" from FileModule
 %% SYSTEM-Module: added command "emptysource" from EmptySourceModule
Suez.r122546> default prompt off
off
Suez.r122546> exception continueEventLoop on
on
Suez.r122546> module sel HbookHistogramModule
 %% SYSTEM-Loader: trying to load "HbookHistogramModule"...
 %% SYSTEM-Module: added command "hbook" from HbookHistogramModule
Suez.r122546> hbook file r122546.rzn
Suez.r122546> hbook init
Suez.r122546> run_file $env(C3_SCRIPTS)/runOnPass2.tcl
Suez.runOnPass2> ##########################################################################
Suez.runOnPass2> ## This is a script that loads some of the producers you might need
Suez.runOnPass2> ## to run on the official pass2 or on privately made "pass2" files.
Suez.runOnPass2> ## To use, add to your tcl script
Suez.runOnPass2> ##
Suez.runOnPass2> ## run_file $env(C3_SCRIPTS)/runOnPass2.tcl
Suez.runOnPass2> ##
Suez.runOnPass2> ##########################################################################
Suez.runOnPass2> ## produce navigation objects
Suez.runOnPass2> prod sel NavigationProd
 %% SYSTEM-Loader: trying to load "NavigationProd"...
Suez.runOnPass2> prod sel TrackDeliveryProd
 %% SYSTEM-Loader: trying to load "TrackDeliveryProd"...
Suez.runOnPass2> ## produce high level CC info
Suez.runOnPass2> prod sel C3ccProd
 %% SYSTEM-Loader: trying to load "C3ccProd"...
Suez.runOnPass2> ## make pi0s, etas
Suez.runOnPass2> prod sel PhotonDecaysProd
 %% SYSTEM-Loader: trying to load "PhotonDecaysProd"...
Suez.runOnPass2> ## Some people's local "pass2" already has k shorts stored
Suez.runOnPass2> ## If you want k shorts in pass2, you will need VFinderProd
Suez.runOnPass2> #prod sel VFinderProd
Suez.runOnPass2> ## magnetic field
Suez.runOnPass2> prod sel MagFieldProd
 %% SYSTEM-Loader: trying to load "MagFieldProd"...
Suez.runOnPass2> ## does analysis time corrections to Dedx
Suez.runOnPass2> prod sel DedxConstProd
 %% SYSTEM-Loader: trying to load "DedxConstProd"...
Suez.runOnPass2> prod sel DedxInfoProd
 %% SYSTEM-Loader: trying to load "DedxInfoProd"...
Suez.runOnPass2> # Electron and Muon fits (and sometimes Proton) were not done in Pass2
Suez.runOnPass2> prod sel ElectronFromPionFitProd
 %% SYSTEM-Loader: trying to load "ElectronFromPionFitProd"...
Suez.runOnPass2> prod sel MuonFromPionFitProd
 %% SYSTEM-Loader: trying to load "MuonFromPionFitProd"...
Suez.runOnPass2> #prod sel ProtonFromPionFitProd
Suez.runOnPass2> ## get magnetic field and beam energy from run statistics
Suez.runOnPass2> module sel CorbaModule
 %% SYSTEM-Loader: trying to load "CorbaModule"...
 %% SYSTEM-Module: added command "corba" from CorbaModule
Suez.runOnPass2> corba init
Suez.runOnPass2> module sel RunStatisticsSourceModule
 %% SYSTEM-Loader: trying to load "RunStatisticsSourceModule"...
 %% SYSTEM-Module: added command "runstatistics" from RunStatisticsSourceModule
Suez.runOnPass2> runstatistics in
 %% INFO-JobControl.SourceManager: creating Source Name "RunStatistics" 
Suez.runOnPass2> ## these are the constants needed by Dedx
Suez.runOnPass2> module sel ConstantsModule
 %% SYSTEM-Loader: trying to load "ConstantsModule"...
 %% SYSTEM-Module: added command "constants" from ConstantsModule
Suez.runOnPass2> constants in $env(C3_CONST) meta Dedx MetaListRetrieval
 %% INFO-JobControl.SourceManager: creating Source Name "Codi" 
Suez.runOnPass2> constants in $env(C3_CONST) meta FieldMap MetaListRetrieval
 %% INFO-JobControl.SourceManager: creating Source Name "Codi_2" 
Suez.runOnPass2> constants in $env(C3_CONST) meta MagFudge MetaListRetrieval
 %% INFO-JobControl.SourceManager: creating Source Name "Codi_3" 
Suez.r122546> prod sel DBEventHeaderProd
 %% SYSTEM-Loader: trying to load "DBEventHeaderProd"...
Suez.r122546> prod sel CesrBeamEnergyProd
 %% SYSTEM-Loader: trying to load "CesrBeamEnergyProd"...
Suez.r122546> prod sel EventPropertiesProd
 %% SYSTEM-Loader: trying to load "EventPropertiesProd"...
Suez.r122546> module sel DBModule
 %% SYSTEM-Loader: trying to load "DBModule"...
OBConfig: overriding default 300 with $OO_RPC_TIMEOUT=300
 %% SYSTEM-Module: added command "database" from DBModule
 %% SYSTEM-Module: added command "dbadmin" from DBModule
Suez.r122546> database in /nfs/cleo3/database/data17/db event startrun beginrun endrun
 %% INFO-DBModule.DBModule: opened database /nfs/cleo3/database/data17/db
 %% INFO-JobControl.SourceManager: creating Source Name "db" 
Suez.r122546> database read_collection pass2 hadron
 %% INFO-DBModule.DBCommand: setting read collection to pass2
 %% INFO-DBModule.DBCommand: setting read sub-collection to hadron
Suez.r122546> database run 122546
Suez.r122546> proc sel EventTypeFilterProc
 %% SYSTEM-Loader: trying to load "EventTypeFilterProc"...
Suez.r122546> param EventTypeFilterProc Hadron true
 %% SYSTEM-Suez: DABoolean: true
Suez.r122546> proc sel ../../build_SunOS/shlib/HadronFilterProc
 %% SYSTEM-Loader: trying to load "../../build_SunOS/shlib/HadronFilterProc"...
Suez.r122546> param HadronFilterProc noBunchWeight true
 %% SYSTEM-Suez: DABoolean: true
Suez.r122546> param HadronFilterProc ntupleSize 50
 %% SYSTEM-Suez: double: 50
Suez.r122546> param HadronFilterProc noBeamSpot false
 %% SYSTEM-Suez: DABoolean: false
Suez.r122546> param HadronFilterProc fillBuffer true
 %% SYSTEM-Suez: DABoolean: true
Suez.r122546> go 1000
 %% INFO-JobControl.SourceManager: Opened data source "RunStatistics".
 %% INFO-JobControl.SourceManager: Opened data source "Codi".
 %% INFO-JobControl.SourceManager: Opened data source "Codi_2".
 %% INFO-JobControl.SourceManager: Opened data source "Codi_3".
 %% INFO-DBDelivery.DBProxyDeliverer: Stream/Collection: beginrun/pass2
 %% INFO-OBSchema.OBVersionId: Subcollection "hadron" does not exist in collection "beginrun"; handing you plain main collection "beginrun"
 %% INFO-OBHandle: Synching to start SyncValue: run/event/time=122546/0/0
 %% ERROR-OBHandle: couldn't sync
 %% ERROR-DBDelivery.DBProxyDeliverer: cannot synchronize: no such run
 %% ERROR-DBDelivery.DBProxyDeliverer: Stream beginrun will not be available.
 %% INFO-DBDelivery.DBProxyDeliverer: Stream/Collection: endrun/pass2
 %% INFO-OBSchema.OBVersionId: Subcollection "hadron" does not exist in collection "endrun"; handing you plain main collection "endrun"
 %% INFO-OBHandle: Synching to start SyncValue: run/event/time=122546/0/0
 %% ERROR-OBHandle: couldn't sync
 %% ERROR-DBDelivery.DBProxyDeliverer: cannot synchronize: no such run
 %% ERROR-DBDelivery.DBProxyDeliverer: Stream endrun will not be available.
 %% INFO-DBDelivery.DBProxyDeliverer: Stream/Collection: event/pass2
 %% INFO-OBHandle: Synching to start SyncValue: run/event/time=122546/0/0
 %% ERROR-OBHandle: couldn't sync
 %% ERROR-DBDelivery.DBProxyDeliverer: cannot synchronize: no such run
 %% ERROR-DBDelivery.DBProxyDeliverer: Stream event will not be available.
 %% INFO-DBDelivery.DBProxyDeliverer: Stream/Collection: startrun/pass2
 %% INFO-OBSchema.OBVersionId: Subcollection "hadron" does not exist in collection "startrun"; handing you plain main collection "startrun"
 %% INFO-OBHandle: Synching to start SyncValue: run/event/time=122546/0/0
 %% ERROR-OBHandle: couldn't sync
 %% ERROR-DBDelivery.DBProxyDeliverer: cannot synchronize: no such run
 %% ERROR-DBDelivery.DBProxyDeliverer: Stream startrun will not be available.
 %% EMERGENCY-JobControl.SourceManager: Source "/nfs/cleo3/database/data17/db": can't goto those stops
Suez> #!/usr/local/bin/tcsh
Suez> 
Suez> cd $HOME/hadron_filter/run/dec25-01/
 %% SYSTEM-Interpreter.TclInterpreter: Tcl_Eval error: can't read "HOME": no such variable
Suez> . /nfs/cleo3/scripts/cleo3defs
 %% SYSTEM-Interpreter.TclInterpreter: Tcl_Eval error: invalid command: '. /nfs/cleo3/scripts/cleo3defs'; type 'help' for available commands
Suez> c3cur
 %% SYSTEM-Interpreter.TclInterpreter: Tcl_Eval error: invalid command: 'c3cur'; type 'help' for available commands
Suez> 
invalid command: 'c3cur'; type 'help' for available commands
Suez> suez -f r122546.tcl > r122546.log
 %% SYSTEM-Interpreter.TclInterpreter: Tcl_Eval error: invalid command: 'suez -f r122546.tcl > r122546.log'; type 'help' for available commands
Suez>  %% INFO-JobControl.SourceManager: Removed source "db".
 %% INFO-DBModule.DBModule: closed database 
 %% INFO-JobControl.SummaryModule: 
 ***** Summary Info *****

   Processed 0 stops.


EDT: 09/12/2002 17:49:33.064249 | xitman.cxx:272: info: (C) xitman starts cleaning...
EDT: 09/12/2002 17:49:33.064582 | runtime.cxx:135: info: (C) BDT checks out...
EDT: 09/12/2002 17:49:33.064727 | runtime.cxx:140: info: (C) Removed basics::theDict.
EDT: 09/12/2002 17:49:33.064852 | xitman.cxx:282: info: (C) xitman done!
